In [2]:
import pandas as pd
import numpy as np

In [3]:
cats = {
    'name': ['Bob', 'Jessica', 'Mary', 'John', 'Mel'],
    'color': ['green', 'black', 'red', 'red', 'blue'],
    'age': [24, 53, 23, 48, 70],
    'chunkiness': [1, 5, 2, 6, 7]
}

cats_df = pd.DataFrame(cats)
cats_df

      name  color  age  chunkiness
0      Bob  green   24           1
1  Jessica  black   53           5
2     Mary    red   23           2
3     John    red   48           6
4      Mel   blue   70           7

In [4]:
cats_df = pd.DataFrame(cats, index=['bo', 'je', 'ma', 'jo', 'me'])
cats_df

       name  color  age  chunkiness
bo      Bob  green   24           1
je  Jessica  black   53           5
ma     Mary    red   23           2
jo     John    red   48           6
me      Mel   blue   70           7

In [5]:
cats_df = pd.DataFrame(np.array([['Bob', 'Jessica', 'Mary', 'John', 'Mel'],
                                 ['green', 'black', 'red', 'red', 'blue'],
                                 [24, 53, 23, 48, 70],
                                 [1, 5, 2, 6, 7]]).T,
                       index=['bo', 'je', 'ma', 'jo', 'me'],
                       columns=['name', 'color', 'age', 'chunkiness'])
cats_df

       name  color age chunkiness
bo      Bob  green  24          1
je  Jessica  black  53          5
ma     Mary    red  23          2
jo     John    red  48          6
me      Mel   blue  70          7

In [6]:
cats_df.columns

Index(['name', 'color', 'age', 'chunkiness'], dtype='object')

In [7]:
cats_df.index

Index(['bo', 'je', 'ma', 'jo', 'me'], dtype='object')

In [8]:
cats_df.values

array([['Bob', 'green', '24', '1'],
       ['Jessica', 'black', '53', '5'],
       ['Mary', 'red', '23', '2'],
       ['John', 'red', '48', '6'],
       ['Mel', 'blue', '70', '7']], dtype=object)

In [9]:
cats_df

       name  color age chunkiness
bo      Bob  green  24          1
je  Jessica  black  53          5
ma     Mary    red  23          2
jo     John    red  48          6
me      Mel   blue  70          7

In [10]:
cats_df['color']

bo    green
je    black
ma      red
jo      red
me     blue
Name: color, dtype: object

In [11]:
cats_df.color

bo    green
je    black
ma      red
jo      red
me     blue
Name: color, dtype: object

In [12]:
cats_df.loc['jo']

name          John
color          red
age             48
chunkiness       6
Name: jo, dtype: object

In [13]:
cats_df.loc[['je', 'ma']]

       name  color age chunkiness
je  Jessica  black  53          5
ma     Mary    red  23          2

In [14]:
cats_df[0:3]

       name  color age chunkiness
bo      Bob  green  24          1
je  Jessica  black  53          5
ma     Mary    red  23          2

In [15]:
cats_df

       name  color age chunkiness
bo      Bob  green  24          1
je  Jessica  black  53          5
ma     Mary    red  23          2
jo     John    red  48          6
me      Mel   blue  70          7

In [16]:
cats_df['age']['je']

'53'

In [17]:
cats_df.index.name = 'id'
cats_df.columns.name = 'attribute'
cats_df

attribute     name  color age chunkiness
id
bo             Bob  green  24          1
je         Jessica  black  53          5
ma            Mary    red  23          2
jo            John    red  48          6
me             Mel   blue  70          7

In [18]:
cats_df['new'] = [1, 2, 3, 4, 5]
cats_df

attribute     name  color age chunkiness  new
id
bo             Bob  green  24          1    1
je         Jessica  black  53          5    2
ma            Mary    red  23          2    3
jo            John    red  48          6    4
me             Mel   blue  70          7    5

In [19]:
cats_df['new'] = 0
cats_df

attribute     name  color age chunkiness  new
id
bo             Bob  green  24          1    0
je         Jessica  black  53          5    0
ma            Mary    red  23          2    0
jo            John    red  48          6    0
me             Mel   blue  70          7    0

In [20]:
cats_df.chunkiness = [6, 2, 3, 5, 1]
cats_df

attribute     name  color age  chunkiness  new
id
bo             Bob  green  24           6    0
je         Jessica  black  53           2    0
ma            Mary    red  23           3    0
jo            John    red  48           5    0
me             Mel   blue  70           1    0

In [21]:
cats_df.new = pd.Series([1, 2, 3, 4, 5], index=['bo', 'je', 'ma', 'jo', 'me'])
cats_df

attribute     name  color age  chunkiness  new
id
bo             Bob  green  24           6    1
je         Jessica  black  53           2    2
ma            Mary    red  23           3    3
jo            John    red  48           5    4
me             Mel   blue  70           1    5

In [22]:
cats_df.new = pd.Series([1, 2, 3, 4, 5], index=['je', 'bo', 'ma', 'jo', 'io'])
cats_df

attribute     name  color age  chunkiness  new
id
bo             Bob  green  24           6  2.0
je         Jessica  black  53           2  1.0
ma            Mary    red  23           3  3.0
jo            John    red  48           5  4.0
me             Mel   blue  70           1  NaN

In [23]:
cats_df['new']['me'] = 999
cats_df

/var/folders/5z/_4ymrqb55gl_n9nt577w6kkm0000gn/T/ipykernel_97126/730843231.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  cats_df['new']['me'] = 999
/var/folders/5z/_4ymrqb55gl_n9nt577w6kkm0000gn/T/ipykernel_97126/730843231.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cats_df['new']['me'] = 999

attribute     name  color age  chunkiness    new
id
bo             Bob  green  24           6    2.0
je         Jessica  black  53           2    1.0
ma            Mary    red  23           3    3.0
jo            John    red  48           5    4.0
me             Mel   blue  70           1  999.0

In [24]:
cats_df.loc['me', 'new'] = 888

In [25]:
cats_df

attribute     name  color age  chunkiness    new
id
bo             Bob  green  24           6    2.0
je         Jessica  black  53           2    1.0
ma            Mary    red  23           3    3.0
jo            John    red  48           5    4.0
me             Mel   blue  70           1  888.0

In [26]:
cats_df.isin(['24', 'Jessica', 888.0, 'Hello'])

attribute   name  color    age  chunkiness    new
id
bo         False  False   True       False  False
je          True  False  False       False  False
ma         False  False  False       False  False
jo         False  False  False       False  False
me         False  False  False       False   True

In [27]:
cats_df[cats_df.isin(['24', 'Jessica', 888.0, 'Hello'])]

attribute     name color  age  chunkiness    new
id
bo             NaN   NaN   24         NaN    NaN
je         Jessica   NaN  NaN         NaN    NaN
ma             NaN   NaN  NaN         NaN    NaN
jo             NaN   NaN  NaN         NaN    NaN
me             NaN   NaN  NaN         NaN  888.0

In [28]:
del cats_df['new']
cats_df

attribute     name  color age  chunkiness
id
bo             Bob  green  24           6
je         Jessica  black  53           2
ma            Mary    red  23           3
jo            John    red  48           5
me             Mel   blue  70           1

In [29]:
del cats_df['chunkiness']

In [30]:
cats_df

attribute     name  color age
id
bo             Bob  green  24
je         Jessica  black  53
ma            Mary    red  23
jo            John    red  48
me             Mel   blue  70

In [31]:
frame = pd.DataFrame(
    np.arange(16).reshape((4, 4)),
    index=['red', 'blue', 'yellow', 'white'],
    columns=['ball', 'pen', 'pencil', 'paper']
)
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [32]:
mask = frame < 8

In [33]:
frame[frame < 8]

        ball  pen  pencil  paper
red      0.0  1.0     2.0    3.0
blue     4.0  5.0     6.0    7.0
yellow   NaN  NaN     NaN    NaN
white    NaN  NaN     NaN    NaN

In [34]:
nestdict = {
    'red': {2012: 22, 2013: 33, 2077: 44},
    'white': {2011: 13, 2012: 22, 2013: 16},
    'blue': {2011: 17, 2012: 27, 2013: 18}
}
frame2 = pd.DataFrame(nestdict)
frame2

       red  white  blue
2012  22.0   22.0  27.0
2013  33.0   16.0  18.0
2077  44.0    NaN   NaN
2011   NaN   13.0  17.0

In [35]:
frame2.transpose()

       2012  2013  2077  2011
red    22.0  33.0  44.0   NaN
white  22.0  16.0   NaN  13.0
blue   27.0  18.0   NaN  17.0

In [36]:
frame2.T

       2012  2013  2077  2011
red    22.0  33.0  44.0   NaN
white  22.0  16.0   NaN  13.0
blue   27.0  18.0   NaN  17.0

In [37]:
frame2.red.idxmin()

np.int64(2012)

In [38]:
frame2.idxmin()

red      2012
white    2011
blue     2011
dtype: int64

In [39]:
frame2.idxmax()

red      2077
white    2012
blue     2012
dtype: int64

In [40]:
frame = pd.DataFrame({
    'color': ['blue', 'green', 'yellow', 'red', 'white'],
    'object': ['ball', 'pen', 'pencil', 'paper', 'mug'],
    'price': [1.2, 1.0, 0.6, 0.9, 1.7]
}, index=[1, 1, 3, 2, 4])
frame

    color  object  price
1    blue    ball    1.2
1   green     pen    1.0
3  yellow  pencil    0.6
2     red   paper    0.9
4   white     mug    1.7

In [41]:
frame.loc[1]

   color object  price
1   blue   ball    1.2
1  green    pen    1.0

In [42]:
frame.index.is_unique

False

In [43]:
frame = pd.DataFrame({
    'color': ['blue', 'green', 'yellow', 'red', 'white'],
    'object': ['ball', 'pen', 'pencil', 'paper', 'mug'],
    'price': [1.2, 1.0, 0.6, 0.9, 1.7]
})
frame

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [44]:
frame.index.is_unique

True

In [50]:
ser = pd.Series([2, 5, 7, 4], index=['one', 'two', 'three', 'four'])
ser

one      2
two      5
three    7
four     4
dtype: int64

In [53]:
ser.reindex(['two', 'one', 'four', 'three', 'five'])

two      5.0
one      2.0
four     4.0
three    7.0
five     NaN
dtype: float64

In [55]:
frame.reindex([4, 3, 2, 0, 1, 5, 7])

    color  object  price
4   white     mug    1.7
3     red   paper    0.9
2  yellow  pencil    0.6
0    blue    ball    1.2
1   green     pen    1.0
5     NaN     NaN    NaN
7     NaN     NaN    NaN

In [57]:
ser3 = pd.Series([1, 5, 6, 3], index=[0, 3, 5, 6])
ser3

0    1
3    5
5    6
6    3
dtype: int64

In [59]:
ser3.reindex(range(6), method='ffill')

0    1
1    1
2    1
3    5
4    5
5    6
dtype: int64

In [61]:
ser3.reindex(range(6), method='bfill')

0    1
1    5
2    5
3    5
4    6
5    6
dtype: int64

In [62]:
frame = pd.DataFrame(np.arange(16).reshape((4, 4)),
                     index=['red', 'blue', 'yellow', 'white'],
                     columns=['ball', 'pen', 'pencil', 'paper'])

frame = frame.drop(['blue', 'yellow'])
frame

       ball  pen  pencil  paper
red       0    1       2      3
white    12   13      14     15

In [63]:
frame.drop(['pen', 'pencil'], axis=1)

       ball  paper
red       0      3
white    12     15

In [66]:
frame.drop(['red'], axis=0)

       ball  pen  pencil  paper
white    12   13      14     15

In [67]:

frame1 = pd.DataFrame(np.arange(16).reshape((4, 4)),
                      index=['red', 'blue', 'yellow', 'white'],
                      columns=['ball', 'pen', 'pencil', 'paper'])

frame2 = pd.DataFrame(np.arange(12).reshape((4, 3)),
                      index=['blue', 'green', 'white', 'yellow'],
                      columns=['mug', 'pen', 'ball'])

In [68]:
frame1

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [69]:
frame2

        mug  pen  ball
blue      0    1     2
green     3    4     5
white     6    7     8
yellow    9   10    11

In [70]:
frame1 + frame2

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [71]:
frame1 / frame2

            ball  mug  paper       pen  pencil
blue    2.000000  NaN    NaN  5.000000     NaN
green        NaN  NaN    NaN       NaN     NaN
red          NaN  NaN    NaN       NaN     NaN
white   1.500000  NaN    NaN  1.857143     NaN
yellow  0.727273  NaN    NaN  0.900000     NaN

In [72]:
frame1.add(frame2)

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [74]:
frame1.add(frame2, fill_value=0)

        ball  mug  paper   pen  pencil
blue     6.0  0.0    7.0   6.0     6.0
green    5.0  3.0    NaN   4.0     NaN
red      0.0  NaN    3.0   1.0     2.0
white   20.0  6.0   15.0  20.0    14.0
yellow  19.0  9.0   11.0  19.0    10.0

In [75]:
frame = pd.DataFrame(np.arange(16).reshape((4, 4)),
                     index=['red', 'blue', 'yellow', 'white'],
                     columns=['ball', 'pen', 'pencil', 'paper'])

frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [76]:
f = lambda x: x.max() - x.min()

frame.apply(f)

ball      12
pen       12
pencil    12
paper     12
dtype: int64

In [77]:
frame.apply(f, axis=1)

red       3
blue      3
yellow    3
white     3
dtype: int64

In [79]:
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [80]:
frame.sum()

ball      24
pen       28
pencil    32
paper     36
dtype: int64

In [81]:
frame.sum(axis=1)

red        6
blue      22
yellow    38
white     54
dtype: int64

In [82]:
frame.mean()

ball      6.0
pen       7.0
pencil    8.0
paper     9.0
dtype: float64

In [83]:
frame.var()

ball      26.666667
pen       26.666667
pencil    26.666667
paper     26.666667
dtype: float64

In [84]:
frame.describe()

            ball        pen     pencil      paper
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [85]:
frame.describe(percentiles=[0.1, 0.9])

            ball        pen     pencil      paper
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
10%     1.200000   2.200000   3.200000   4.200000
50%     6.000000   7.000000   8.000000   9.000000
90%    10.800000  11.800000  12.800000  13.800000
max    12.000000  13.000000  14.000000  15.000000

In [86]:
frame.describe(percentiles=[0.1, 0.9], include='all')

            ball        pen     pencil      paper
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
10%     1.200000   2.200000   3.200000   4.200000
50%     6.000000   7.000000   8.000000   9.000000
90%    10.800000  11.800000  12.800000  13.800000
max    12.000000  13.000000  14.000000  15.000000